Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# HashWrite_Warning
source: The destination is inside the calculated range, so writing changes the value.
ar: الوجهة داخل النطاق المحسوب، لذا تؤدي الكتابة إلى تغيير القيمة.
cs: Cíl leží uvnitř počítaného rozsahu, takže zápis hodnotu změní.
de: Das Ziel liegt innerhalb des berechneten Bereichs, daher ändert das Schreiben den Wert.
el: Ο προορισμός βρίσκεται μέσα στο υπολογιζόμενο εύρος, επομένως η εγγραφή αλλάζει την τιμή.
es: El destino está dentro del rango calculado, por lo que escribir cambia el valor.
fa: مقصد درون محدودهٔ محاسبه‌شده است، بنابراین نوشتن مقدار را تغییر می‌دهد.
fr: La destination se trouve dans la plage calculée ; l'écriture modifie donc la valeur.
hu: A cél a kiszámított tartományon belül van, ezért az írás megváltoztatja az értéket.
id: Tujuan berada di dalam rentang yang dihitung, sehingga menulis akan mengubah nilainya.
it: La destinazione è all'interno dell'intervallo calcolato, quindi la scrittura modifica il valore.
ja: 書き込み先が計算の対象範囲に含まれるため、書き込むと値が変わります。
ko: 쓸 위치가 계산 범위 안에 있으므로 쓰면 값이 변경됩니다.
pl: Miejsce docelowe leży w obliczanym zakresie, więc zapis zmieni wartość.
pt: O destino está dentro do intervalo calculado, então a gravação altera o valor.
ro: Destinația se află în intervalul calculat, așa că scrierea modifică valoarea.
th: ปลายทางอยู่ภายในช่วงที่คำนวณ การเขียนจึงจะเปลี่ยนค่า
tr: Hedef, hesaplanan aralığın içinde olduğundan yazmak değeri değiştirir.
uk: Місце запису розташоване всередині обчислюваного діапазону, тому запис змінить значення.
vi: Đích ghi nằm trong phạm vi được tính, nên việc ghi sẽ làm thay đổi giá trị.
zh_hans: 写入位置位于计算范围内，因此写入会改变该值。
zh_hant: 目的地位於計算範圍內，因此寫入會改變此值。

# HashWrite_Error_End
source: Cannot write past the end of the document ({0} bytes left, {1} needed).
ar: لا يمكن الكتابة بعد نهاية المستند (المتبقي {0} بايت، والمطلوب {1}).
cs: Nelze zapisovat za konec dokumentu (zbývá bajtů: {0}, potřeba: {1}).
de: Schreiben über das Ende des Dokuments hinaus nicht möglich ({0} Bytes übrig, {1} benötigt).
el: Δεν είναι δυνατή η εγγραφή πέρα από το τέλος του εγγράφου (απομένουν {0} byte, χρειάζονται {1}).
es: No se puede escribir más allá del final del documento (quedan {0} bytes, se necesitan {1}).
fa: نوشتن فراتر از پایان سند ممکن نیست ({0} بایت باقی است، {1} لازم است).
fr: Impossible d'écrire au-delà de la fin du document ({0} octets restants, {1} nécessaires).
hu: Nem lehet a dokumentum végén túl írni ({0} bájt van hátra, {1} szükséges).
id: Tidak dapat menulis melewati akhir dokumen (tersisa {0} byte, perlu {1}).
it: Impossibile scrivere oltre la fine del documento (restano {0} byte, ne servono {1}).
ja: 末尾を超えるため書き込めません (残り {0} バイト、必要 {1} バイト)。
ko: 문서 끝을 넘어 쓸 수 없습니다({0}바이트 남음, {1}바이트 필요).
pl: Nie można zapisać poza końcem dokumentu (pozostało B: {0}, potrzeba: {1}).
pt: Não é possível gravar além do fim do documento (restam {0} bytes, são necessários {1}).
ro: Nu se poate scrie după sfârșitul documentului (rămân {0} octeți, sunt necesari {1}).
th: ไม่สามารถเขียนเลยจุดสิ้นสุดของเอกสาร (เหลือ {0} ไบต์ ต้องการ {1})
tr: Belgenin sonunu aşarak yazılamaz ({0} bayt kaldı, {1} gerekli).
uk: Не можна записати за кінцем документа (залишилося {0} байтів, потрібно {1}).
vi: Không thể ghi quá cuối tài liệu (còn {0} byte, cần {1}).
zh_hans: 无法写入超出文档末尾的位置（剩余 {0} 字节，需要 {1} 字节）。
zh_hant: 無法寫入超過文件結尾的位置（剩餘 {0} 個位元組，需要 {1} 個）。

# CustomCrc_Title
source: Custom CRC
ar: CRC مخصص
cs: Vlastní CRC
de: Benutzerdefinierter CRC
el: Προσαρμοσμένο CRC
es: CRC personalizado
fa: CRC سفارشی
fr: CRC personnalisé
hu: Egyéni CRC
id: CRC kustom
it: CRC personalizzato
ja: カスタム CRC
ko: 사용자 지정 CRC
pl: Niestandardowy CRC
pt: CRC personalizado
ro: CRC personalizat
th: CRC ที่กำหนดเอง
tr: Özel CRC
uk: Власний CRC
vi: CRC tùy chỉnh
zh_hans: 自定义 CRC
zh_hant: 自訂 CRC

# CustomCrc_Save
source: Save
ar: حفظ
cs: Uložit
de: Speichern
el: Αποθήκευση
es: Guardar
fa: ذخیره
fr: Enregistrer
hu: Mentés
id: Simpan
it: Salva
ja: 保存
ko: 저장
pl: Zapisz
pt: Salvar
ro: Salvare
th: บันทึก
tr: Kaydet
uk: Зберегти
vi: Lưu
zh_hans: 保存
zh_hant: 儲存

# CustomCrc_Preset
source: Preset
ar: إعداد مسبق
cs: Předvolba
de: Vorgabe
el: Προκαθορισμένο
es: Valor predefinido
fa: پیش‌تنظیم
fr: Préréglage
hu: Készlet
it: Preimpostazione
ja: プリセット
ko: 프리셋
pl: Ustawienie wstępne
pt: Predefinição
ro: Presetare
th: ค่าที่ตั้งไว้ล่วงหน้า
tr: Hazır ayar
uk: Набір
vi: Thiết lập sẵn
zh_hans: 预设
zh_hant: 預設集

# CustomCrc_Duplicate
source: Duplicate and edit
ar: تكرار وتحرير
cs: Duplikovat a upravit
de: Duplizieren und bearbeiten
el: Αντιγραφή και επεξεργασία
es: Duplicar y editar
fa: تکثیر و ویرایش
fr: Dupliquer et modifier
hu: Kettőzés és szerkesztés
id: Duplikat dan edit
it: Duplica e modifica
ja: 複製して編集
ko: 복제하여 편집
pl: Duplikuj i edytuj
pt: Duplicar e editar
ro: Duplicare și editare
th: ทำสำเนาและแก้ไข
tr: Çoğalt ve düzenle
uk: Дублювати й змінити
vi: Nhân bản và chỉnh sửa
zh_hans: 复制并编辑
zh_hant: 複製並編輯

# CustomCrc_Name
source: Name
ar: الاسم
cs: Název
el: Όνομα
es: Nombre
fa: نام
fr: Nom
hu: Név
id: Nama
it: Nome
ja: 名前
ko: 이름
pl: Nazwa
pt: Nome
ro: Nume
th: ชื่อ
tr: Ad
uk: Назва
vi: Tên
zh_hans: 名称
zh_hant: 名稱

# CustomCrc_Width
source: Width (bits)
ar: العرض (بت)
cs: Šířka (bity)
de: Breite (Bits)
el: Πλάτος (bit)
es: Ancho (bits)
fa: پهنا (بیت)
fr: Largeur (bits)
hu: Szélesség (bit)
id: Lebar (bit)
it: Larghezza (bit)
ja: 幅 (width)
ko: 너비(비트)
pl: Szerokość (bity)
pt: Largura (bits)
ro: Lățime (biți)
th: ความกว้าง (บิต)
tr: Genişlik (bit)
uk: Ширина (біти)
vi: Độ rộng (bit)
zh_hans: 宽度（位）
zh_hant: 寬度（位元）

# CustomCrc_Poly
source: Polynomial (poly)
ar: متعدد الحدود (poly)
cs: Polynom (poly)
de: Polynom (poly)
el: Πολυώνυμο (poly)
es: Polinomio (poly)
fa: چندجمله‌ای (poly)
fr: Polynôme (poly)
hu: Polinom (poly)
id: Polinomial (poly)
it: Polinomio (poly)
ja: 多項式 (poly)
ko: 다항식(poly)
pl: Wielomian (poly)
pt: Polinômio (poly)
ro: Polinom (poly)
th: พหุนาม (poly)
tr: Polinom (poly)
uk: Поліном (poly)
vi: Đa thức (poly)
zh_hans: 多项式 (poly)
zh_hant: 多項式（poly）

# CustomCrc_Init
source: Initial value (init)
ar: القيمة الأولية (init)
cs: Počáteční hodnota (init)
de: Startwert (init)
el: Αρχική τιμή (init)
es: Valor inicial (init)
fa: مقدار اولیه (init)
fr: Valeur initiale (init)
hu: Kezdőérték (init)
id: Nilai awal (init)
it: Valore iniziale (init)
ja: 初期値 (init)
ko: 초기값(init)
pl: Wartość początkowa (init)
pt: Valor inicial (init)
ro: Valoare inițială (init)
th: ค่าเริ่มต้น (init)
tr: Başlangıç değeri (init)
uk: Початкове значення (init)
vi: Giá trị ban đầu (init)
zh_hans: 初始值 (init)
zh_hant: 初始值（init）

# CustomCrc_RefIn
source: Reflect input (refin)
ar: عكس الإدخال (refin)
cs: Zrcadlit vstup (refin)
de: Eingabe spiegeln (refin)
el: Αντανάκλαση εισόδου (refin)
es: Reflejar entrada (refin)
fa: بازتاب ورودی (refin)
fr: Refléter l'entrée (refin)
hu: Bemenet tükrözése (refin)
id: Cerminkan input (refin)
it: Rifletti input (refin)
ja: 入力の反転 (refin)
ko: 입력 반사(refin)
pl: Odbij wejście (refin)
pt: Refletir entrada (refin)
ro: Reflectare intrare (refin)
th: สะท้อนอินพุต (refin)
tr: Girişi yansıt (refin)
uk: Відображати вхід (refin)
vi: Phản chiếu đầu vào (refin)
zh_hans: 反转输入 (refin)
zh_hant: 反射輸入（refin）

# CustomCrc_RefOut
source: Reflect output (refout)
ar: عكس الإخراج (refout)
cs: Zrcadlit výstup (refout)
de: Ausgabe spiegeln (refout)
el: Αντανάκλαση εξόδου (refout)
es: Reflejar salida (refout)
fa: بازتاب خروجی (refout)
fr: Refléter la sortie (refout)
hu: Kimenet tükrözése (refout)
id: Cerminkan output (refout)
it: Rifletti output (refout)
ja: 出力の反転 (refout)
ko: 출력 반사(refout)
pl: Odbij wyjście (refout)
pt: Refletir saída (refout)
ro: Reflectare ieșire (refout)
th: สะท้อนเอาต์พุต (refout)
tr: Çıkışı yansıt (refout)
uk: Відображати вихід (refout)
vi: Phản chiếu đầu ra (refout)
zh_hans: 反转输出 (refout)
zh_hant: 反射輸出（refout）

# CustomCrc_XorOut
source: Final XOR (xorout)
ar: XOR النهائي (xorout)
cs: Závěrečný XOR (xorout)
de: Abschließendes XOR (xorout)
el: Τελικό XOR (xorout)
es: XOR final (xorout)
fa: XOR نهایی (xorout)
fr: XOR final (xorout)
hu: Záró XOR (xorout)
id: XOR akhir (xorout)
it: XOR finale (xorout)
ja: 最終 XOR (xorout)
ko: 최종 XOR(xorout)
pl: Końcowy XOR (xorout)
pt: XOR final (xorout)
ro: XOR final (xorout)
th: XOR สุดท้าย (xorout)
tr: Son XOR (xorout)
uk: Кінцевий XOR (xorout)
vi: XOR cuối (xorout)
zh_hans: 最终 XOR (xorout)
zh_hant: 最終 XOR（xorout）

# CustomCrc_Field_Name
source: The name
ar: الاسم
cs: Název
de: Name
el: Το όνομα
es: nombre
fa: نام
fr: nom
hu: A név
id: Nama
it: Il nome
ja: 名前
ko: 이름
pl: Nazwa
pt: O nome
ro: Numele
th: ชื่อ
tr: Ad
uk: Назва
vi: Tên
zh_hans: 名称
zh_hant: 名稱

# CustomCrc_Field_Width
source: The width
ar: العرض
cs: Šířka
de: Breite
el: Το πλάτος
es: ancho
fa: پهنا
fr: largeur
hu: A szélesség
id: Lebar
it: La larghezza
ja: 幅
ko: 너비
pl: Szerokość
pt: A largura
ro: Lățimea
th: ความกว้าง
tr: Genişlik
uk: Ширина
vi: Độ rộng
zh_hans: 宽度
zh_hant: 寬度

# CustomCrc_Field_Poly
source: The polynomial
ar: متعدد الحدود
cs: Polynom
de: Polynom
el: Το πολυώνυμο
es: polinomio
fa: چندجمله‌ای
fr: polynôme
hu: A polinom
id: Polinomial
it: Il polinomio
ja: 多項式
ko: 다항식
pl: Wielomian
pt: O polinômio
ro: Polinomul
th: พหุนาม
tr: Polinom
uk: Поліном
vi: Đa thức
zh_hans: 多项式
zh_hant: 多項式

# CustomCrc_Field_Init
source: The initial value
ar: القيمة الأولية
cs: Počáteční hodnota
de: Startwert
el: Η αρχική τιμή
es: valor inicial
fa: مقدار اولیه
fr: valeur initiale
hu: A kezdőérték
id: Nilai awal
it: Il valore iniziale
ja: 初期値
ko: 초기값
pl: Wartość początkowa
pt: O valor inicial
ro: Valoarea inițială
th: ค่าเริ่มต้น
tr: Başlangıç değeri
uk: Початкове значення
vi: Giá trị ban đầu
zh_hans: 初始值
zh_hant: 初始值

# CustomCrc_Field_XorOut
source: The final XOR
ar: XOR النهائي
cs: Závěrečný XOR
de: Abschließendes XOR
el: Το τελικό XOR
es: XOR final
fa: XOR نهایی
fr: XOR final
hu: A záró XOR
id: XOR akhir
it: Lo XOR finale
ja: 最終 XOR
ko: 최종 XOR
pl: Końcowy XOR
pt: O XOR final
ro: XOR-ul final
th: XOR สุดท้าย
tr: Son XOR
uk: Кінцевий XOR
vi: XOR cuối
zh_hans: 最终 XOR
zh_hant: 最終 XOR

# CustomCrc_Field_Item
source: The item
ar: العنصر
cs: Položka
de: Element
el: Το στοιχείο
es: elemento
fa: مورد
fr: élément
hu: Az elem
id: Item
it: L'elemento
ja: 項目
ko: 항목
pl: Element
pt: O item
ro: Elementul
th: รายการ
tr: Öğe
uk: Елемент
vi: Mục
zh_hans: 项
zh_hant: 項目

# CustomCrc_Error_NameRequired
source: Enter a name.
ar: أدخل اسمًا.
cs: Zadejte název.
de: Geben Sie einen Namen ein.
el: Εισαγάγετε ένα όνομα.
es: Escribe un nombre.
fa: نامی وارد کنید.
fr: Entrez un nom.
hu: Adjon meg egy nevet.
id: Masukkan nama.
it: Immetti un nome.
ja: 名前を入力してください。
ko: 이름을 입력하세요.
pl: Wprowadź nazwę.
pt: Insira um nome.
ro: Introduceți un nume.
th: ป้อนชื่อ
tr: Bir ad girin.
uk: Введіть назву.
vi: Hãy nhập tên.
zh_hans: 请输入名称。
zh_hant: 請輸入名稱。

# CustomCrc_Error_DuplicateName
source: An algorithm with this name already exists.
ar: توجد بالفعل خوارزمية بهذا الاسم.
cs: Algoritmus s tímto názvem již existuje.
de: Ein Algorithmus mit diesem Namen ist bereits vorhanden.
el: Υπάρχει ήδη αλγόριθμος με αυτό το όνομα.
es: Ya existe un algoritmo con este nombre.
fa: الگوریتمی با این نام از قبل وجود دارد.
fr: Un algorithme portant ce nom existe déjà.
hu: Már létezik ilyen nevű algoritmus.
id: Algoritme dengan nama ini sudah ada.
it: Esiste già un algoritmo con questo nome.
ja: 同じ名前のアルゴリズムがあります。
ko: 이 이름의 알고리즘이 이미 있습니다.
pl: Algorytm o tej nazwie już istnieje.
pt: Já existe um algoritmo com este nome.
ro: Există deja un algoritm cu acest nume.
th: มีอัลกอริทึมชื่อนี้อยู่แล้ว
tr: Bu adda bir algoritma zaten var.
uk: Алгоритм із такою назвою вже існує.
vi: Đã có thuật toán trùng tên.
zh_hans: 已存在同名的算法。
zh_hant: 已經有同名的演算法。

# CustomCrc_Error_WidthOutOfRange
source: The width must be 1 to 64.
ar: يجب أن يكون العرض من 1 إلى 64.
cs: Šířka musí být od 1 do 64.
de: Die Breite muss zwischen 1 und 64 liegen.
el: Το πλάτος πρέπει να είναι από 1 έως 64.
es: El ancho debe estar entre 1 y 64.
fa: پهنا باید از 1 تا 64 باشد.
fr: La largeur doit être comprise entre 1 et 64.
hu: A szélesség 1 és 64 között lehet.
id: Lebar harus 1 hingga 64.
it: La larghezza deve essere compresa tra 1 e 64.
ja: 幅は 1〜64 です。
ko: 너비는 1~64여야 합니다.
pl: Szerokość musi wynosić od 1 do 64.
pt: A largura deve estar entre 1 e 64.
ro: Lățimea trebuie să fie între 1 și 64.
th: ความกว้างต้องอยู่ระหว่าง 1 ถึง 64
tr: Genişlik 1 ile 64 arasında olmalıdır.
uk: Ширина має бути від 1 до 64.
vi: Độ rộng phải từ 1 đến 64.
zh_hans: 宽度必须为 1 到 64。
zh_hant: 寬度必須介於 1 到 64 之間。

# CustomCrc_Error_ValueTooWide
source: {0} must fit in {1} bits.
ar: يجب أن يتسع {0} في {1} بت.
cs: {0}: hodnota se musí vejít do {1} bitů.
de: Das Feld „{0}“ muss in {1} Bits passen.
el: Το {0} πρέπει να χωράει σε {1} bit.
es: El campo “{0}” debe caber en {1} bits.
fa: {0} باید در {1} بیت جا شود.
fr: Le champ « {0} » doit tenir sur {1} bits.
hu: {0}: legfeljebb {1} bites lehet.
id: {0} harus muat dalam {1} bit.
it: {0} deve rientrare in {1} bit.
ja: {0}は {1} bit 以内で指定してください。
ko: {0}은(는) {1}비트 이내여야 합니다.
pl: {0} musi mieścić się w {1} bitach.
pt: {0} deve caber em {1} bits.
ro: {0} trebuie să încapă în {1} biți.
th: {0} ต้องพอดีใน {1} บิต
tr: {0}, {1} bite sığmalıdır.
uk: {0}: значення має вміщуватися в {1} біт.
vi: {0} phải vừa trong {1} bit.
zh_hans: {0}必须在 {1} 位以内。
zh_hant: {0}必須在 {1} 位元以內。

# CustomCrc_Error_MissingField
source: {0} is missing.
ar: {0} مفقود.
cs: {0}: chybí.
de: Das Feld „{0}“ fehlt.
el: Λείπει το {0}.
es: Falta el campo “{0}”.
fa: {0} وجود ندارد.
fr: Le champ « {0} » est manquant.
hu: {0}: hiányzik.
id: {0} tidak ada.
it: {0} mancante.
ja: {0}がありません。
ko: {0}이(가) 없습니다.
pl: Brak pola {0}.
pt: {0} está ausente.
ro: {0} lipsește.
th: ไม่มี{0}
tr: {0} eksik.
uk: {0}: відсутнє.
vi: Thiếu {0}.
zh_hans: 缺少{0}。
zh_hant: 缺少{0}。

# CustomCrc_Error_InvalidValue
source: {0} is not a valid number.
ar: {0} ليس رقمًا صالحًا.
cs: {0}: není platné číslo.
de: Das Feld „{0}“ ist keine gültige Zahl.
el: Το {0} δεν είναι έγκυρος αριθμός.
es: El campo “{0}” no es un número válido.
fa: {0} عدد معتبری نیست.
fr: Le champ « {0} » n'est pas un nombre valide.
hu: {0}: nem érvényes szám.
id: {0} bukan angka yang valid.
it: {0} non è un numero valido.
ja: {0}が正しい数値ではありません。
ko: {0}이(가) 올바른 숫자가 아닙니다.
pl: {0} nie jest prawidłową liczbą.
pt: {0} não é um número válido.
ro: {0} nu este un număr valid.
th: {0} ไม่ใช่ตัวเลขที่ถูกต้อง
tr: {0} geçerli bir sayı değil.
uk: {0}: неприпустиме число.
vi: {0} không phải là số hợp lệ.
zh_hans: {0}不是有效的数字。
zh_hant: {0}不是有效的數字。

# CustomCrc_Error_CheckMismatch
source: The check value does not match the parameters.
ar: قيمة check لا تطابق المعاملات.
cs: Kontrolní hodnota (check) neodpovídá parametrům.
de: Der check-Wert passt nicht zu den Parametern.
el: Η τιμή check δεν ταιριάζει με τις παραμέτρους.
es: El valor check no coincide con los parámetros.
fa: مقدار check با پارامترها همخوانی ندارد.
fr: La valeur check ne correspond pas aux paramètres.
hu: A check érték nem egyezik a paraméterekkel.
id: Nilai check tidak cocok dengan parameter.
it: Il valore di controllo non corrisponde ai parametri.
ja: check の値がパラメータと合いません。
ko: check 값이 매개 변수와 일치하지 않습니다.
pl: Wartość kontrolna nie pasuje do parametrów.
pt: O valor de verificação não corresponde aos parâmetros.
ro: Valoarea check nu corespunde parametrilor.
th: ค่า check ไม่ตรงกับพารามิเตอร์
tr: Check değeri parametrelerle uyuşmuyor.
uk: Значення check не відповідає параметрам.
vi: Giá trị check không khớp với các tham số.
zh_hans: check 值与参数不匹配。
zh_hant: check 值與參數不符。

# CustomCrc_Error_NotAnObject
source: The item is not an object.
ar: العنصر ليس كائنًا.
cs: Položka není objekt.
de: Das Element ist kein Objekt.
el: Το στοιχείο δεν είναι αντικείμενο.
es: El elemento no es un objeto.
fa: مورد یک شیء نیست.
fr: L'élément n'est pas un objet.
hu: Az elem nem objektum.
id: Item bukan objek.
it: L'elemento non è un oggetto.
ja: 項目がオブジェクトではありません。
ko: 항목이 개체가 아닙니다.
pl: Element nie jest obiektem.
pt: O item não é um objeto.
ro: Elementul nu este un obiect.
th: รายการไม่ใช่ออบเจ็กต์
tr: Öğe bir nesne değil.
uk: Елемент не є об’єктом.
vi: Mục không phải là đối tượng.
zh_hans: 该项不是对象。
zh_hant: 項目不是物件。

# CustomCrc_Error_InvalidJson
source: The file is not valid JSON.
ar: الملف ليس JSON صالحًا.
cs: Soubor není platný JSON.
de: Die Datei ist kein gültiges JSON.
el: Το αρχείο δεν είναι έγκυρο JSON.
es: El archivo no es un JSON válido.
fa: فایل JSON معتبری نیست.
fr: Le fichier n'est pas un JSON valide.
hu: A fájl nem érvényes JSON.
id: File bukan JSON yang valid.
it: Il file non è un JSON valido.
ja: JSON として読めません。
ko: 파일이 올바른 JSON이 아닙니다.
pl: Plik nie jest prawidłowym plikiem JSON.
pt: O arquivo não é um JSON válido.
ro: Fișierul nu este JSON valid.
th: ไฟล์ไม่ใช่ JSON ที่ถูกต้อง
tr: Dosya geçerli bir JSON değil.
uk: Файл не є допустимим JSON.
vi: Tệp không phải JSON hợp lệ.
zh_hans: 该文件不是有效的 JSON。
zh_hant: 檔案不是有效的 JSON。

# CustomCrc_Error_NotAnArray
source: The file does not contain an array.
ar: لا يحتوي الملف على مصفوفة.
cs: Soubor neobsahuje pole.
de: Die Datei enthält kein Array.
el: Το αρχείο δεν περιέχει πίνακα.
es: El archivo no contiene una matriz.
fa: فایل آرایه‌ای ندارد.
fr: Le fichier ne contient pas de tableau.
hu: A fájl nem tartalmaz tömböt.
id: File tidak berisi array.
it: Il file non contiene un array.
ja: 配列ではありません。
ko: 파일에 배열이 없습니다.
pl: Plik nie zawiera tablicy.
pt: O arquivo não contém uma matriz.
ro: Fișierul nu conține o matrice.
th: ไฟล์ไม่มีอาร์เรย์
tr: Dosya bir dizi içermiyor.
uk: Файл не містить масиву.
vi: Tệp không chứa mảng.
zh_hans: 该文件不包含数组。
zh_hant: 檔案不包含陣列。

# CustomCrc_ImportItemError
source: Cannot read item {0}: {1}
ar: تتعذر قراءة العنصر {0}: {1}
cs: Položku {0} nelze přečíst: {1}
de: Element {0} kann nicht gelesen werden: {1}
el: Δεν είναι δυνατή η ανάγνωση του στοιχείου {0}: {1}
es: No se puede leer el elemento {0}: {1}
fa: خواندن مورد {0} ممکن نیست: {1}
fr: Impossible de lire l'élément {0} : {1}
hu: A(z) {0}. elem nem olvasható: {1}
id: Tidak dapat membaca item {0}: {1}
it: Impossibile leggere l'elemento {0}: {1}
ja: {0} 件目の項目を読み込めません: {1}
ko: {0}번째 항목을 읽을 수 없습니다: {1}
pl: Nie można odczytać elementu {0}: {1}
pt: Não é possível ler o item {0}: {1}
ro: Elementul {0} nu poate fi citit: {1}
th: ไม่สามารถอ่านรายการ {0}: {1}
tr: {0}. öğe okunamıyor: {1}
uk: Не вдається прочитати елемент {0}: {1}
vi: Không thể đọc mục {0}: {1}
zh_hans: 无法读取第 {0} 项：{1}
zh_hant: 無法讀取第 {0} 個項目：{1}

# CustomCrc_Imported
source: {0, plural, one {Imported # custom CRC.} other {Imported # custom CRCs.}}
ar: {0, plural, zero {تم استيراد # CRC مخصص.} one {تم استيراد CRC مخصص واحد.} two {تم استيراد اثنين من CRC المخصصة.} few {تم استيراد # من CRC المخصصة.} many {تم استيراد # من CRC المخصصة.} other {تم استيراد # من CRC المخصصة.}}
cs: {0, plural, one {Importováno # vlastní CRC.} few {Importována # vlastní CRC.} many {Importováno # vlastního CRC.} other {Importováno # vlastních CRC.}}
de: {0, plural, one {# benutzerdefinierter CRC importiert.} other {# benutzerdefinierte CRCs importiert.}}
el: {0, plural, one {Εισήχθη # προσαρμοσμένο CRC.} other {Εισήχθησαν # προσαρμοσμένα CRC.}}
es: {0, plural, one {Se importó # CRC personalizado.} other {Se importaron # CRC personalizados.}}
fa: {0, plural, one {# CRC سفارشی وارد شد.} other {# CRC سفارشی وارد شد.}}
fr: {0, plural, one {# CRC personnalisé importé.} other {# CRC personnalisés importés.}}
hu: {0, plural, one {# egyéni CRC importálva.} other {# egyéni CRC importálva.}}
id: {0, plural, other {# CRC kustom diimpor.}}
it: {0, plural, one {Importato # CRC personalizzato.} other {Importati # CRC personalizzati.}}
ja: カスタム CRC を {0} 件取り込みました。
ko: {0, plural, other {사용자 지정 CRC #개를 가져왔습니다.}}
pl: {0, plural, one {Zaimportowano # niestandardowy CRC.} few {Zaimportowano # niestandardowe CRC.} many {Zaimportowano # niestandardowych CRC.} other {Zaimportowano # niestandardowego CRC.}}
pt: {0, plural, one {# CRC personalizado importado.} other {# CRCs personalizados importados.}}
ro: {0, plural, one {S-a importat # CRC personalizat.} few {S-au importat # CRC-uri personalizate.} other {S-au importat # de CRC-uri personalizate.}}
th: {0, plural, other {นำเข้า CRC ที่กำหนดเอง # รายการแล้ว}}
tr: {0, plural, one {# özel CRC içeri aktarıldı.} other {# özel CRC içeri aktarıldı.}}
uk: {0, plural, one {Імпортовано # власний CRC.} few {Імпортовано # власні CRC.} many {Імпортовано # власних CRC.} other {Імпортовано # власного CRC.}}
vi: {0, plural, other {Đã nhập # CRC tùy chỉnh.}}
zh_hans: {0, plural, other {已导入 # 个自定义 CRC。}}
zh_hant: {0, plural, other {已匯入 # 個自訂 CRC。}}

# CustomCrc_Exported
source: Exported to {0}.
ar: تم التصدير إلى {0}.
cs: Exportováno do {0}.
de: Nach {0} exportiert.
el: Εξήχθη στο {0}.
es: Se exportó a {0}.
fa: به {0} صادر شد.
fr: Exporté vers {0}.
hu: Exportálva ide: {0}.
id: Diekspor ke {0}.
it: Esportato in {0}.
ja: {0} にエクスポートしました。
ko: {0}(으)로 내보냈습니다.
pl: Wyeksportowano do {0}.
pt: Exportado para {0}.
ro: S-a exportat în {0}.
th: ส่งออกไปยัง {0} แล้ว
tr: {0} konumuna aktarıldı.
uk: Експортовано в {0}.
vi: Đã xuất ra {0}.
zh_hans: 已导出到 {0}。
zh_hant: 已匯出至 {0}。

# Hash_Alg_sum64
source: Sum 64-bit
ar: مجموع 64 بت
cs: Součet 64 bitů
de: Summe 64 Bit
el: Άθροισμα 64 bit
es: Suma de 64 bits
fa: جمع 64 بیتی
fr: Somme 64 bits
hu: Összeg, 64 bites
id: Jumlah 64-bit
it: Somma a 64 bit
ja: 加算 64 bit
ko: 합계 64비트
pl: Suma 64-bitowa
pt: Soma de 64 bits
ro: Sumă pe 64 de biți
th: ผลรวม 64 บิต
tr: Toplam 64 bit
uk: Сума 64 біти
vi: Tổng 64 bit
zh_hans: 求和 64 位
zh_hant: 總和 64 位元

# Hash_Alg_sum16w
source: Sum 16-bit (words)
ar: مجموع 16 بت (كلمات)
cs: Součet 16 bitů (slova)
de: Summe 16 Bit (Wörter)
el: Άθροισμα 16 bit (λέξεις)
es: Suma de 16 bits (palabras)
fa: جمع 16 بیتی (کلمه‌ها)
fr: Somme 16 bits (mots)
hu: Összeg, 16 bites (szavak)
id: Jumlah 16-bit (word)
it: Somma a 16 bit (word)
ja: 加算 16 bit (ワード単位)
ko: 합계 16비트(워드)
pl: Suma 16-bitowa (słowa)
pt: Soma de 16 bits (palavras)
ro: Sumă pe 16 biți (cuvinte)
th: ผลรวม 16 บิต (เวิร์ด)
tr: Toplam 16 bit (sözcükler)
uk: Сума 16 біт (слова)
vi: Tổng 16 bit (word)
zh_hans: 求和 16 位（按字）
zh_hant: 總和 16 位元（字組）

# Hash_Alg_sum32w
source: Sum 32-bit (words)
ar: مجموع 32 بت (كلمات)
cs: Součet 32 bitů (slova)
de: Summe 32 Bit (Wörter)
el: Άθροισμα 32 bit (λέξεις)
es: Suma de 32 bits (palabras)
fa: جمع 32 بیتی (کلمه‌ها)
fr: Somme 32 bits (mots)
hu: Összeg, 32 bites (szavak)
id: Jumlah 32-bit (word)
it: Somma a 32 bit (word)
ja: 加算 32 bit (ワード単位)
ko: 합계 32비트(워드)
pl: Suma 32-bitowa (słowa)
pt: Soma de 32 bits (palavras)
ro: Sumă pe 32 de biți (cuvinte)
th: ผลรวม 32 บิต (เวิร์ด)
tr: Toplam 32 bit (sözcükler)
uk: Сума 32 біти (слова)
vi: Tổng 32 bit (word)
zh_hans: 求和 32 位（按字）
zh_hant: 總和 32 位元（字組）

# Hash_Alg_sum64w
source: Sum 64-bit (words)
ar: مجموع 64 بت (كلمات)
cs: Součet 64 bitů (slova)
de: Summe 64 Bit (Wörter)
el: Άθροισμα 64 bit (λέξεις)
es: Suma de 64 bits (palabras)
fa: جمع 64 بیتی (کلمه‌ها)
fr: Somme 64 bits (mots)
hu: Összeg, 64 bites (szavak)
id: Jumlah 64-bit (word)
it: Somma a 64 bit (word)
ja: 加算 64 bit (ワード単位)
ko: 합계 64비트(워드)
pl: Suma 64-bitowa (słowa)
pt: Soma de 64 bits (palavras)
ro: Sumă pe 64 de biți (cuvinte)
th: ผลรวม 64 บิต (เวิร์ด)
tr: Toplam 64 bit (sözcükler)
uk: Сума 64 біти (слова)
vi: Tổng 64 bit (word)
zh_hans: 求和 64 位（按字）
zh_hant: 總和 64 位元（字組）

# Hash_Alg_inet16
source: Internet checksum
ar: المجموع الاختباري للإنترنت
cs: Internetový kontrolní součet
de: Internet-Prüfsumme
el: Άθροισμα ελέγχου Internet
es: Suma de comprobación de Internet
fa: چک‌سام اینترنت
fr: Somme de contrôle Internet
hu: Internetes ellenőrzőösszeg
id: Checksum Internet
it: Checksum Internet
ja: インターネットチェックサム
ko: 인터넷 체크섬
pl: Suma kontrolna Internetu
pt: Soma de verificação da Internet
ro: Sumă de control Internet
th: เช็กซัมอินเทอร์เน็ต
tr: İnternet sağlama toplamı
uk: Контрольна сума Інтернету
vi: Tổng kiểm tra Internet
zh_hans: Internet 校验和
zh_hant: 網際網路總和檢查碼
